/**
 *
 * 文 件 名 : EscPrintCom.h
 * 创建日期 : 2014-02-21 13:12
 * 作    者 : 邵凯田(skt001@163.com)
 * 修改日期 : $Date: $
 * 当前版本 : $Revision: $
 * 功能描述 : ESC(EPSON Standard Code for Printer)指令集基于串口的打印类
 * 修改记录 : 
 *            $Log: $
 *
 * Ver  Date        Author  Comments
 * ---  ----------  ------  -------------------------------------------
 * 001	2014-02-21  邵凯田  串口打印支持
 *
 **/


#ifndef __SKT_ESC_PRINT_COM_H_
#define __SKT_ESC_PRINT_COM_H_

#include "SEscPrint.h"
#include "../SCom.h"


//////////////////////////////////////////////////////////////////////////
// 名    称:  SEscPrintCom  
// 作    者:  邵凯田
// 创建时间:  2014:2:21 13:30
// 描    述:  串口打印
//////////////////////////////////////////////////////////////////////////
class SBASE_ESCPRINT_EXPORT SEscPrintCom : public SEscPrint
{
public:
	SEscPrintCom();
	virtual ~SEscPrintCom();

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  打印初始化
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 13:46
	// 参数说明:  @sAttr为扩展属性，不同实现类提供不同的参数
	// 返 回 值:  true表示初始化成功,false表示初始化失败
	//////////////////////////////////////////////////////////////////////////
	virtual bool Init(SString sAttr);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  打开打印机
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 13:23
	// 参数说明:  @sAttr为打印机参数
	// 返 回 值:  true打开成功，false打开失败
	//////////////////////////////////////////////////////////////////////////
	virtual bool Open(SString sAttr);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  关闭打印机
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 13:26
	// 参数说明:  void
	// 返 回 值:  true关闭成功，false关闭失败
	//////////////////////////////////////////////////////////////////////////
	virtual bool Close();

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  向打印机写数据
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 13:31
	// 参数说明:  @pBuffer待写入内容缓冲区指针
	//            @iLen为缓冲区字节长度
	// 返 回 值:  >0表示实际发送字节数，<=0表示失败
	//////////////////////////////////////////////////////////////////////////
	virtual int Write(BYTE *pBuffer,int iLen);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  从打印机读取数据
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 13:35
	// 参数说明:  @pBuffer为待读入缓冲区指针
	//            @iLen为期望读取字节长度
	// 返 回 值:  >0表示实际读取字节数，<0表示读取失败，=0表示读取超时
	//////////////////////////////////////////////////////////////////////////
	virtual int Read(BYTE *pBuffer,int iLen);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  是否已经打开了打印机
	// 作    者:  邵凯田
	// 创建时间:  2014:2:21 15:24
	// 参数说明:  void
	// 返 回 值:  true/false
	//////////////////////////////////////////////////////////////////////////
	virtual bool IsOpened(){return m_Com.GetHandle()!=0;};


private:
	SCom m_Com;
	SString m_sAttr;
};


#endif /*__SKT_ESC_PRINT_COM_H_*/
