/**
 *
 * 文 件 名 : SChPinyin.h
 * 创建日期 : 2015-7-10 16:17
 * 作    者 : 邵凯田(skt001@163.com)
 * 修改日期 : $Date: $
 * 当前版本 : $Revision: $
 * 功能描述 : 汉字拼音相关封装类
 * 修改记录 : 
 *            $Log: $
 *
 * Ver  Date        Author  Comments
 * ---  ----------  ------  -------------------------------------------
 * 001	2015-7-10	邵凯田　创建文件
 *
 **/
#ifndef __SCHINESE_PY_H__
#define __SCHINESE_PY_H__

#include "SHash.h"
#include "SString.h"

struct SBASE_EXPORT stuSChPinyinAlphabet		//汉字库结构
{
	char chinese[3];			//汉字
	char firstletter;			//首字母
};

class SBASE_EXPORT SChinesePy
{
public:
	SChinesePy();
	~SChinesePy();

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  取指定字符串对应的拼音字符，不考虑多音字
	// 作    者:  邵凯田
	// 创建时间:  2015-7-10 17:28
	// 参数说明:  @pStr表示源字符串
	// 返 回 值:  返回拼音首字母编码字符串
	//////////////////////////////////////////////////////////////////////////
	static SString GetChinesePy(char *pStr);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  判断指针字符串与过滤字符串是否匹配，过滤字符串支持汉语拼音首字母缩写匹配
	// 作    者:  邵凯田
	// 创建时间:  2015-7-10 17:00
	// 参数说明:  @sSrcText为源字符串
	//         :  @sFilterText为匹配字符串,支持空格分隔多个条件，多个条件间的关系为与
	// 返 回 值:  true表示匹配，false表示不匹配
	//////////////////////////////////////////////////////////////////////////
	static bool IsMatchText(char *sSrcText,char *sFilterText);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  取字符对应的内码，可以是ASCII或汉字
	// 作    者:  邵凯田
	// 创建时间:  2015-7-10 17:04
	// 参数说明:  @cbParam表示this实例
	//         :  @pItem对应char*型字符串
	// 返 回 值:  int表示字符唯一的编码值
	//////////////////////////////////////////////////////////////////////////
	static int GetCh_Key(void *cbParam,void *pItem);
};

#endif//__SCHINESE_PY_H__
